In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter', 'number'])

In [3]:
df1.append(df2)

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [4]:
# ignore_index=True
df1.append(df2, ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [7]:
# Mismatching columns
df1_a = pd.DataFrame([['a', 1], ['b', 2]], columns=['letter1', 'number1'])
df2_a = pd.DataFrame([['c', 3], ['d', 4]], columns=['letter2', 'number2'])

df1_a.append(df2_a)

  letter1  number1 letter2  number2
0       a      1.0     NaN      NaN
1       b      2.0     NaN      NaN
0     NaN      NaN       c      3.0
1     NaN      NaN       d      4.0